php_api/app/Validation/Userrules.php

SELECT `user_id`
FROM `settings`
JOIN `exams` ON `exams`.`id` = `settings`.`exam_id`
WHERE `settings`.`id` = 'xlySjNwVpdkqPtP6jS1UodUAumKy813AaV9OcZrxCeQ58WbztqelH7QfRvIz4gGT'
---
public function is_owner($id, string $fields, array $data, &$error = null) {
$options = explode(',', $fields);

if(!isset($options[0]) || !isset($options[1])) {
$error = lang(' Please provide the owner id. ');
return false;
}
$db = db_connect();
$request = \Config\Services::request();

switch($options[1]) {
case "exams":
$query = $db->table('exams')->where('id', $id)->get();
$result = $query->getRow();


break;
case "assignments":
$query = $db->table('settings')->join('exams', 'exams.id = settings.exam_id')->select('user_id')->where('settings.id', $id)->get();