php_api/app/Subscriptions/BaseSubscription.php

SELECT *
FROM `plans`
WHERE `user_id` = 'PgbW4Dr0ZfV3L8uTya7N4Wdx7j5QLVj2tPmXrztmFesEFoZbJCNnpwUYKkqO5ykv'
AND `started_on` <= 1681264732
AND `expires_on` >= 1681264732
AND `status` = 'active'
ORDER BY `created_at` DESC
 LIMIT 1
---
public function getActive($user_id) {
$plan = $this->plans->where('user_id', $user_id)->where('started_on <=', time())->where('expires_on >=', time())->where('status', 'active')->orderBy('created_at', 'desc')->first();