php_api/app/Subscriptions/Credits.php

public function getAvailable($user_id) {
$user = $this->users->where('id', $user_id)->first();
---
SELECT *
FROM `users`
WHERE `id` = 'PgbW4Dr0ZfV3L8uTya7N4Wdx7j5QLVj2tPmXrztmFesEFoZbJCNnpwUYKkqO5ykv'
 LIMIT 1