php_api/app/Libraries/Corrections/Corrections.php

public function run($result_id) {

$answers = $this->answers->where('result_id', $result_id)->where('has_attempted', 'yes')->orderBy('number', 'asc')->findAll();

$assign = $this->attempts->join('settings', 'settings.id = attempts.assign_id')->where('attempts.id', $result_id)->first();
$newarray = [];
foreach($answers as $answer) {
$question = $this->questions->where('id', $answer->question_id)->first();
---
SELECT *
FROM `answers`
WHERE `result_id` = 'afd2e979-a16c-46cf-9a0a-e60db1385861'
AND `has_attempted` = 'yes'
ORDER BY `number` ASC
SELECT *
FROM `attempts`
JOIN `settings` ON `settings`.`id` = `attempts`.`assign_id`
WHERE `attempts`.`id` = 'afd2e979-a16c-46cf-9a0a-e60db1385861'
 LIMIT 1
SELECT *
FROM `questions`
WHERE `id` = '1'
 LIMIT 1