php_api/app/Models/Plans.php

public function getActivePlan($user_id) {
$plan = $this->where('user_id', $user_id)->where('expires_on >=', time())->where('status', 'active')->orderBy('created_at', 'desc')->first();
---
SELECT *
FROM `plans`
WHERE `user_id` = 'PgbW4Dr0ZfV3L8uTya7N4Wdx7j5QLVj2tPmXrztmFesEFoZbJCNnpwUYKkqO5ykv'
AND `expires_on` >= 1681264761
AND `status` = 'active'
ORDER BY `created_at` DESC
 LIMIT 1