php_api/app/Models/QuestionSheet.php

SELECT count(question_sheet.entity_id) as total_questions, sum(questions.point) as total_points
FROM `question_sheet`
JOIN `questions` ON `questions`.`id` = `question_sheet`.`question_id`
WHERE `question_sheet`.`entity_id` = '04vbaBwxlcQm03hrGQbyrqe2NoNHDyZpPVXC5UWsDho14JCKEFsLKYiW99uMRdMY'
 LIMIT 1
---
public function getPoints($entity_id) {
$stats = (array) $this->join('questions', 'questions.id = question_sheet.question_id')->select('count(question_sheet.entity_id) as total_questions, sum(questions.point) as total_points ')->where('question_sheet.entity_id', $entity_id)->first();