php_api/app/Helpers/Notifications_helper.php

INSERT INTO `notifications` (`action`, `member_id`, `message`) VALUES ('created', 'PgbW4Dr0ZfV3L8uTya7N4Wdx7j5QLVj2tPmXrztmFesEFoZbJCNnpwUYKkqO5ykv', ' Ashokkumar selvam has completed the attempt 245 in question editing . ')
---
function notify($user_id, $message) {
$db = db_connect();
$db->table('notifications')->insert([
'action' => 'created',
'member_id' => $user_id,
'message' => $message,

]);