php_api/app/Controllers/Admin/Assignments.php

    public function show($id = null)
    {
if(!$this->us->is_owner($id, 'assignments'))
return $this->fail(['message' => 'You are not allowed to access this resource. ']);

$isInstructor = $this->is->is_instructor();
if($isInstructor && !$this->is->has_access('assignments', 'view'))
return $this->fail(['message' => $this->is->getError()]);

$exam = $this->model->join('exams', 'exams.id = settings.exam_id')->select('settings.*, exams.title')->where('settings.id', $id)->where('exams.user_id', $isInstructor ? $this->request->user->admin_id: $this->request->user->uuid)->first();
if(!$exam)
return $this->failNotFound(' Unable to find the assignment');

$users = $this->db->table('attempts')->join('results', 'attempts.id = results.id')->select(' count(distinct attempts.member_id) as users, count(*) as results  ')->where('attempts.assign_id', $id)->get();
$users = $users->getRow();

$options = [
'attempts' => $this->db->table('attempts')->where('assign_id', $id)->countAllResults(),
'results' => $users->results,
'users' => $users->users,
'status' => $exam->end_time == 0 || ($exam->end_time/1000) > time() ? 'Running': (($exam->end_time/1000) < time() ?  'Expired': 'don not know'),
];
---
SELECT `settings`.*, `exams`.`title`
FROM `settings`
JOIN `exams` ON `exams`.`id` = `settings`.`exam_id`
WHERE `settings`.`id` = 'xlySjNwVpdkqPtP6jS1UodUAumKy813AaV9OcZrxCeQ58WbztqelH7QfRvIz4gGT'
AND `exams`.`user_id` = 'PgbW4Dr0ZfV3L8uTya7N4Wdx7j5QLVj2tPmXrztmFesEFoZbJCNnpwUYKkqO5ykv'
 LIMIT 1
SELECT count(distinct attempts.member_id) as users, count(*) as results
FROM `attempts`
JOIN `results` ON `attempts`.`id` = `results`.`id`
WHERE `attempts`.`assign_id` = 'xlySjNwVpdkqPtP6jS1UodUAumKy813AaV9OcZrxCeQ58WbztqelH7QfRvIz4gGT'
SELECT COUNT(*) AS `numrows`
FROM `attempts`
WHERE `assign_id` = 'xlySjNwVpdkqPtP6jS1UodUAumKy813AaV9OcZrxCeQ58WbztqelH7QfRvIz4gGT'

    public function update($id = null)
    {
$isInstructor = $this->is->is_instructor();
if($isInstructor && !$this->is->has_access('assignments', 'edit'))
return $this->fail(['message' => $this->is->getError()]);

$rules = [
'id' => 'required|is_owner[id,assignments]|is_not_unique[settings.id]',
'segment' => 'required|in_list[instructions,users,questions,time,results]'];
$errors = [];
if(!$this->validate($rules, $errors))
return $this->failValidationErrors($this->validator->getErrors());
$request = (array) $this->request->getVar();

$exam = $this->model->join('exams', 'exams.id = settings.exam_id')->select('settings.*, exams.title')->where('settings.id', $request['id'])->where('exams.user_id', $this->request->user->uuid)->first();
---
SELECT `settings`.*, `exams`.`title`
FROM `settings`
JOIN `exams` ON `exams`.`id` = `settings`.`exam_id`
WHERE `settings`.`id` = 'xlySjNwVpdkqPtP6jS1UodUAumKy813AaV9OcZrxCeQ58WbztqelH7QfRvIz4gGT'
AND `exams`.`user_id` = 'PgbW4Dr0ZfV3L8uTya7N4Wdx7j5QLVj2tPmXrztmFesEFoZbJCNnpwUYKkqO5ykv'
 LIMIT 1