php_api/app/Controllers/Admin/Exams.php

SELECT COUNT(*) AS `numrows`
FROM `questions`
JOIN `question_sheet` ON `questions`.`id` = `question_sheet`.`question_id`
WHERE `question_sheet`.`entity_id` = '04vbaBwxlcQm03hrGQbyrqe2NoNHDyZpPVXC5UWsDho14JCKEFsLKYiW99uMRdMY'
---
    public function index()
    {
$isInstructor = $this->is->is_instructor();
if($isInstructor && !$this->is->has_access('exams', 'view'))
return $this->fail(['message' => $this->is->getError()]);

$exams = $this->model->where('user_id', $isInstructor ? $this->request->user->admin_id: $this->request->user->uuid)->orderBy('created_at', 'desc')->findAll();
foreach($exams as $exam) {
$exam->questions = $this->questions->join('question_sheet', 'questions.id = question_sheet.question_id')->where('question_sheet.entity_id', $exam->id)->countAllResults();

SELECT `questions`.*
FROM `questions`
JOIN `question_sheet` ON `questions`.`id` = `question_sheet`.`question_id`
WHERE `question_sheet`.`entity_id` = '04vbaBwxlcQm03hrGQbyrqe2NoNHDyZpPVXC5UWsDho14JCKEFsLKYiW99uMRdMY'
SELECT `id`, `assign_to`, `assignee_id`, `start_time`
FROM `settings`
WHERE `exam_id` = '04vbaBwxlcQm03hrGQbyrqe2NoNHDyZpPVXC5UWsDho14JCKEFsLKYiW99uMRdMY'
ORDER BY `created_at` DESC
 LIMIT 10
---
    public function show($id = null)
    {
$exam = $this->model->where('id', $id)->first();
if(!$exam)
return $this->failNotFound('Unable to find the exam');

if(!$this->us->is_owner($id, 'exams'))
return $this->fail(['message' => 'You are not allowed to access this resource. ']);


$isInstructor = $this->is->is_instructor();
if($isInstructor && !$this->is->has_access('exams', 'view'))
return $this->fail(['message' => $this->is->getError()]);

$questions = $this->questions->join('question_sheet', 'questions.id = question_sheet.question_id')->select('questions.*')->where('question_sheet.entity_id', $id)->findAll();
$assignments = $this->settings->select(' id, assign_to, assignee_id, start_time ')->where('exam_id', $exam->id)->orderBy('created_at', 'desc')->findAll(10);

SELECT COUNT(*) AS `numrows`
FROM `attempts`
JOIN `settings` ON `settings`.`id` = `attempts`.`assign_id`
JOIN `exams` ON `exams`.`id` = `settings`.`exam_id`
WHERE `settings`.`exam_id` = '04vbaBwxlcQm03hrGQbyrqe2NoNHDyZpPVXC5UWsDho14JCKEFsLKYiW99uMRdMY'
SELECT COUNT(*) AS `numrows`
FROM `settings`
WHERE `exam_id` = '04vbaBwxlcQm03hrGQbyrqe2NoNHDyZpPVXC5UWsDho14JCKEFsLKYiW99uMRdMY'
---
'created_at' => $exam->created_at,
'questions' => count($questions),
'points' => $this->qsheet->getPoints($exam->id),
'results' => $this->attempts->join('settings', 'settings.id = attempts.assign_id')->join('exams', 'exams.id = settings.exam_id')->where('settings.exam_id', $exam->id)->countAllResults(),
'assignments' => $this->settings->where('exam_id', $exam->id)->countAllResults(),