php_api/app/Controllers/Admin/Groups.php

    public function index()
    {

$isInstructor = $this->is->is_instructor();
if($isInstructor && !$this->is->has_access('groups', 'view'))
return $this->fail(['message' => $this->is->getError()]);

try {
$groups = $this->model->where('user_id', $isInstructor ? $this->request->user->admin_id: $this->request->user->uuid)->findAll();
foreach($groups as $group) {
$group->total = $this->groupmembers->where('group_id', $group->id)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `group_members`
WHERE `group_id` = 'BMbZiWNhTkG8tWG6C2sX4nIaLmXqxyjJAlgezqnAHOlzgh49BTef3CSyw7MERpKr'

    public function show($id= null)
    {

if(!$this->us->is_owner($id, 'groups'))
return $this->fail(['message' => 'You are not allowed to access this resource. ']);
$isInstructor = $this->is->is_instructor();
if($isInstructor && !$this->is->has_access('groups', 'view'))
return $this->fail(['message' => $this->is->getError()]);
$group = $this->model->where('id', $id)->first();
if(!$group)
return $this->failValidationError('The group is not found');

$members = $this->groupmembers->join('users', 'users.id = group_members.member_id')->select('concat(users.first_name, " ", users.last_name) as name, users.id, users.email  ')->where('group_members.group_id', $id)->findAll();
---
SELECT concat(users.first_name, " ", users.last_name) as name, `users`.`id`, `users`.`email`
FROM `group_members`
JOIN `users` ON `users`.`id` = `group_members`.`member_id`
WHERE `group_members`.`group_id` = 'qOYgoFj7cumR1e5XJDGIlntReTQQbrVpT0ZKva3EpXDvFnIm1gJhBzxYO9sN4LSC'