php_api/app/Controllers/Admin/Profile.php

SELECT `first_name`, `last_name`, `email`, `mobile`, `referral_code`
FROM `users`
WHERE `id` = 'PgbW4Dr0ZfV3L8uTya7N4Wdx7j5QLVj2tPmXrztmFesEFoZbJCNnpwUYKkqO5ykv'
 LIMIT 1
---
public function getAccount() {
if($this->is->is_instructor())
return $this->fail(['message' => 'You are not allowed to access this resource.']);

$user = $this->users->select('first_name, last_name, email, mobile, referral_code')->where('id', $this->request->user->uuid)->first();