php_api/app/Controllers/Admin/Quizzes.php

SELECT COUNT(*) AS `numrows`
FROM `questions`
JOIN `question_sheet` ON `questions`.`id` = `question_sheet`.`question_id`
WHERE `question_sheet`.`entity_id` = 'LFWbVaih0kPgT8UXz3N9CwsgsSyurEp1vKlpYA6ZvNGqz240SwPbQ3k7j7HfhqIR'
---
    public function index()
    {

$isInstructor = $this->is->is_instructor();
if($isInstructor && !$this->is->has_access('quizzes', 'view'))
return $this->fail(['message' => $this->is->getError()]);
$quizzes = $this->model->where('user_id', $isInstructor ? $this->request->user->admin_id: $this->request->user->uuid)->orderBy('created_at', 'desc')->findAll();
foreach($quizzes as $quiz) {
$quiz->questions = $this->questions->join('question_sheet', 'questions.id = question_sheet.question_id')->where('question_sheet.entity_id', $quiz->id)->countAllResults();