php_api/app/Securities/InstructorSecurity.php

public function is_instructor() {
$cacheKey = $this->request->user->uuid;
$cacheValue = cache()->get($cacheKey);
if($cacheValue !== null)
return $cacheValue;



$userData = $this->us->getData();
$instructor = $this->instructors->where('id', $userData->uuid)->first();
---
SELECT *
FROM `instructors`
WHERE `id` = 'PgbW4Dr0ZfV3L8uTya7N4Wdx7j5QLVj2tPmXrztmFesEFoZbJCNnpwUYKkqO5ykv'
 LIMIT 1