php_api/app/Securities/UserSecurity.php

public function is_registered_user() {
$as = new AuthSecurity();
$user = $as->longterm_decript();
if($user === false) {
$this->setError(' it is not registered user');
return false;
}

$query = $this->db->table('users')->where('id', $user['uuid'])->get();
---
SELECT *
FROM `users`
WHERE `id` = 'PgbW4Dr0ZfV3L8uTya7N4Wdx7j5QLVj2tPmXrztmFesEFoZbJCNnpwUYKkqO5ykv'

public function is_owner($id, $entity) {
    $cacheKey = 'is_owner_' . $entity . '_' . $id . '_' . $this->request->user->uuid;
    if ($result = cache()->get($cacheKey)) {
        return $result;
    }

//$user = $this->getData();
$db = db_connect();
switch($entity) {
case "exams":
$query = $db->table('exams')->where('id', $id)->get();
$result = $query->getRow();
break;
case "assignments":
$query = $db->table('settings')->join('exams', 'exams.id = settings.exam_id')->select('exams.user_id')->where('settings.id', $id)->get();
$result = $query->getRow();

break;
case "quizzes":
$query = $db->table('quizzes')->where('id', $id)->get();
$result = $query->getRow();

break;
case "groups":
$query = $db->table('groups')->where('id', $id)->get();
---
SELECT *
FROM `exams`
WHERE `id` = '04vbaBwxlcQm03hrGQbyrqe2NoNHDyZpPVXC5UWsDho14JCKEFsLKYiW99uMRdMY'
SELECT `exams`.`user_id`
FROM `settings`
JOIN `exams` ON `exams`.`id` = `settings`.`exam_id`
WHERE `settings`.`id` = 'xlySjNwVpdkqPtP6jS1UodUAumKy813AaV9OcZrxCeQ58WbztqelH7QfRvIz4gGT'
SELECT *
FROM `groups`
WHERE `id` = 'qOYgoFj7cumR1e5XJDGIlntReTQQbrVpT0ZKva3EpXDvFnIm1gJhBzxYO9sN4LSC'