php_api/app/Controllers/Common/Common.php

    public function showResult($id = null)
    {
if(!$this->checkinfo($id, false))
return $this->checkinfo($id);
$settings = $this->settings->join('attempts', 'attempts.assign_id = settings.id')->select('settings.*')->where('attempts.id', $id)->first();
switch($settings->result_type) {
case "complete_result":
$result = $this->results->where('id', $id)->first();
$admin = $this->exams->join('users', 'users.id = exams.user_id')->select('concat(users.first_name, " ", users.last_name) as name, title, description, subject')->where('exams.id', $settings->exam_id)->first();
$show_explanation = $settings->show_explanation;

$result->answers = $this->answers->join('questions', 'questions.id = answers.question_id')->select("questions.answer as correct_answer, if(strcmp(\"$show_explanation\",\"yes\") = 0, questions.explanation, 0) as explanation, answers.*")->where('answers.result_id', $id)->orderBy('answers.number', 'asc')->findAll();
---
SELECT `settings`.*
FROM `settings`
JOIN `attempts` ON `attempts`.`assign_id` = `settings`.`id`
WHERE `attempts`.`id` = '29041386-b219-4f75-8bc9-97b493e10384'
 LIMIT 1
SELECT *
FROM `results`
WHERE `id` = '29041386-b219-4f75-8bc9-97b493e10384'
 LIMIT 1
SELECT concat(users.first_name, " ", users.last_name) as name, `title`, `description`, `subject`
FROM `exams`
JOIN `users` ON `users`.`id` = `exams`.`user_id`
WHERE `exams`.`id` = 'ilAGpsFitVwMnS7Y8fwEHuNLTX5DRK4r9tQXAjZY84yDvu1egZ5BPhC69cNOFOz1'
 LIMIT 1
SELECT `questions`.`answer` as `correct_answer`, if(strcmp("no", "yes") = 0, `questions`.`explanation`, 0) as explanation, `answers`.*
FROM `answers`
JOIN `questions` ON `questions`.`id` = `answers`.`question_id`
WHERE `answers`.`result_id` = '29041386-b219-4f75-8bc9-97b493e10384'
ORDER BY `answers`.`number` ASC

public function checkinfo($result_id, $return = true) {
$result = $this->results->where('id', $result_id)->first();
if(!$result)
return $return ? $this->failNotFound(' Unable to find the result. Please make sure you have completed the exam. '): false;

if(!$this->us->is_user())
return $return ? $this->respond(['action' => 'login', 'reason' => 'Only logged in users can view the result. ']): false;

$user = $this->us->getData();

if($result->member_id != $user->uuid)
return $return ? $this->respond(['action' => 'reject', 'reason' => 'You are not allowed to view this result. Only the particular user can see the result']): false;

$settings = $this->settings->join('attempts', 'attempts.assign_id = settings.id')->select('settings.*')->where('attempts.id', $result_id)->first();
---
SELECT *
FROM `results`
WHERE `id` = '29041386-b219-4f75-8bc9-97b493e10384'
 LIMIT 1
SELECT `settings`.*
FROM `settings`
JOIN `attempts` ON `attempts`.`assign_id` = `settings`.`id`
WHERE `attempts`.`id` = '29041386-b219-4f75-8bc9-97b493e10384'
 LIMIT 1