php_api/app/Controllers/Common/Exams.php

UPDATE `attempts` SET `status` = 'completed'
WHERE `id` = 'afd2e979-a16c-46cf-9a0a-e60db1385861'
SELECT `settings`.`result_method`, `settings`.`publish_on`, `settings`.`exam_id`, `attempts`.`member_id`, `attempts`.`attempt`, `attempts`.`id` as `result_id`, `settings`.`published`, `settings`.`message` as `result_message`
FROM `attempts`
JOIN `settings` ON `attempts`.`assign_id` = `settings`.`id`
WHERE `attempts`.`id` = 'afd2e979-a16c-46cf-9a0a-e60db1385861'
 LIMIT 1
SELECT *
FROM `exams`
WHERE `id` = 'ilAGpsFitVwMnS7Y8fwEHuNLTX5DRK4r9tQXAjZY84yDvu1egZ5BPhC69cNOFOz1'
 LIMIT 1
SELECT concat(first_name, " ", last_name) as name
FROM `users`
WHERE `id` = 'PgbW4Dr0ZfV3L8uTya7N4Wdx7j5QLVj2tPmXrztmFesEFoZbJCNnpwUYKkqO5ykv'
 LIMIT 1
---
public function finish() {
$rules = [
'result_id' => 'required|is_not_unique[attempts.id]',
'time' => 'required|numeric'];
$errors = [];
if(!$this->validate($rules, $errors))
return $this->failValidationErrors($this->validator->getErrors());
$request = (array) $this->request->getVar();
$status = $this->corrections->run($request['result_id']);
if(!$status)
return $this->fail(['message' => $this->corrections->getError()]);

$saved = $this->setResult($request['result_id'], $status, $request['time']);

$this->attempts->where('id', $request['result_id'])->set('status', 'completed')->update();
$result = $this->attempts->join('settings', 'attempts.assign_id = settings.id')->select('settings.result_method, settings.publish_on, settings.exam_id, attempts.member_id, attempts.attempt, attempts.id as result_id, settings.published, settings.message as result_message')->where('attempts.id', $request['result_id'])->first();
if(!$result)
return $this->failNotFound("Unable to find the result. Don't worry. your answers are safe.");

$exam = $this->exams->where('id', $result->exam_id)->first();
$user = $this->users->select(' concat(first_name, " ", last_name) as name ')->where('id', $result->member_id)->first() ?? $this->anonymoususers->where('id', $result->member_id)->first();

SELECT *
FROM `attempts`
WHERE `id` = 'afd2e979-a16c-46cf-9a0a-e60db1385861'
 LIMIT 1
SELECT concat(first_name, " ", last_name) as name, "Registered User" as `type`
FROM `users`
WHERE `id` = 'PgbW4Dr0ZfV3L8uTya7N4Wdx7j5QLVj2tPmXrztmFesEFoZbJCNnpwUYKkqO5ykv'
 LIMIT 1
SELECT `settings`.*
FROM `attempts`
JOIN `settings` ON `settings`.`id` = `attempts`.`assign_id`
WHERE `attempts`.`id` = 'afd2e979-a16c-46cf-9a0a-e60db1385861'
 LIMIT 1
SELECT *
FROM `exams`
WHERE `id` = 'ilAGpsFitVwMnS7Y8fwEHuNLTX5DRK4r9tQXAjZY84yDvu1egZ5BPhC69cNOFOz1'
 LIMIT 1
SELECT `questions`.`answer` as `correct_answer`, `answers`.*
FROM `answers`
JOIN `questions` ON `questions`.`id` = `answers`.`question_id`
WHERE `result_id` = 'afd2e979-a16c-46cf-9a0a-e60db1385861'
SELECT `attend`.*
FROM `attempts`
JOIN `attend` ON `attend`.`result_id`= `attempts`.`id`
WHERE `attempts`.`id` = 'afd2e979-a16c-46cf-9a0a-e60db1385861'
 LIMIT 1
---
public function setResult($result_id, $status = 'completed', $time = false) {
$attempt = $this->attempts->where('id', $result_id)->first();

$user = $this->users->select('concat(first_name, " ", last_name) as name, "Registered User" as type ')->where('id', $attempt->member_id)->first() ?? $this->anonymoususers->select('name, id, "Anonymous User" as type')->where('id', $attempt->member_id)->first();
$assign = $this->attempts->join('settings', 'settings.id = attempts.assign_id')->select('settings.*')->where('attempts.id', $attempt->id)->first();
$exam = $this->exams->where('id', $assign->exam_id)->first();
$answers = $this->answers->join('questions', 'questions.id = answers.question_id')->select('questions.answer as correct_answer, answers.* ')->where('result_id', $attempt->id)->findAll();
$attend = $this->attempts->join('attend', 'attend.result_id= attempts.id')->select('attend.*')->where('attempts.id', $result_id)->first();